<template>
  <div class="owner-wrapper">
    <div class="navigator-wrapper linear-gradient-bg">
      <div class="navigator">
        <div class="nav-wrapper">
          <div class="avatar-wrapper" @click="goback">
            <div class="avatar">
              <i class="icon-return"></i>
            </div>
          </div>
          <div class="tab-wrapper">
            <p class="header-text">{{header.headerTitle}}</p>
          </div>
        </div>
      </div>
    </div>
    <div class="brand-wrapper">
      <mt-index-list>
        <mt-index-section v-for="item in letters" :key="item" index="{{}}">
          <mt-cell title="Aaron"></mt-cell>
        </mt-index-section>
      </mt-index-list>
    </div>
    <div class="model-wrapper" v-show="isShowBrandModel">
  
    </div>
  </div>
</template>

<script>
export default {
  data: () => {
    return {
      header: {
        headerTitle: '品牌型号'
      },
      isShowBrandModel: false,
      brands: {
        "A-奥迪":
        ["A1", "A3", "A4", "A4L", "A5", "A6", "A6L", "A7", "A8L", "Q3", "Q5", "Q7 ", "S4", "S5", "S6", "S8", "TT ", "R8", "Allroad quattro"],
        "A-奥驰": [],
        "A-奥玲": [],
        "A-阿斯顿·马丁":
        ["One-77", "Rapide", "Virage", "V12 Vantage", "V8 Vantage", "DB9", "DBS"],
        "B-奔驰Smart": [],
        "B-保时捷": ["Boxster", "卡曼", "卡宴", "Panamera", "911", "918"],
        "B-宾利": ["雅骏", "雅致", "欧陆"],
        "B-标致": ["206", "206CC", "207", "207CC", "307", "307CC", "308", "406", "407", "408", "508", "607", "3008", "308CC", "RCZ"],
        "B-宝骏": [],
        "B-北汽": ["域胜", "骑士", "战旗"],
        "B-比亚迪": ["F0", "F3", "F3R", "F3DM", "F6", "E6", "G3", "G3R", "G6", "L3", "M6", "S6", "S8", "速锐", "福莱尔"],
        "B-奔驰": ["A160", "A180", "B180", "B200", "B260", "C180", "C200", "C230", "C260", "C280", "C300", "C63 AMG", "CL600", "CLS300", "CLS350", "CLS500", "CLS63 AMG", "CLK200", "CLK280", "CLK350", "E200", "E260", "E300", "E350", "E63 AMG", "G500", "G55 AMG", "GL350", "GL450", "GL550", "GL63 AMG", "GLA200", "GLK300", "GLK350", "ML300", "ML350", "ML400", "ML63 AMG", "ML500", "R300", "R350", "R500", "S300L", "S350L", "S400L", "S500L", "S600L", "S63 AMG", "S65 AMG", "SL300", "SL350", "SL500", "SL63 AMG", "SLK200", "SLK300", "SLK350", "SLK55 AMG", "SLS", "唯雅诺", "中誉房车"],
        "B-奔腾": ["B50", "B70", "B90", "SUV"],
        "B-本田": ["缤智", "杰德", "CR-V", "飞度", "锋范", "雅阁", "奥德赛", "思域", "思迪", "思铂睿", "里程", "歌诗图"],
        "B-宝马": ["218i", "116i", "118i", "120i", "318", "320", "320i", "320敞篷", "325", "330", "428i", "420i", "GT320", "520", "523i", "523Li", "525Li", "530Li", "528Li", "535", "GT535", "6系", "730Li", "740", "745", "750", "760", "X1", "X3", "X5", "X6", "Z4", "M"],
        "B-宝马MINI": ["COUNTRYMAN", "MINI", " CLUBMAN", "CABRIO", "COUPE", "ROADSTER", "PACEMAN"], "B-别克": ["GL8", "凯越", "凯越HRV", "凯越旅行车", "君威", "君越", "英朗GT", "英朗XT", "荣御", "赛欧", "林荫大道", "昂科雷", "昂科拉", "新世纪"],
        "C-长安": ["CS15", "CS35", "奔奔", "CX20", "CX30", "星光", "S460", "之星", "杰勋", "金牛星", "悦翔", "志翔", "镭蒙", "CM8", "星卡", "欧诺"],
        "C-昌河": ["爱迪尔", "福瑞达", "海豚", "骏马", "面包车"],
        "C-长丰": ["飞铃", "飞扬", "猎豹", "帕杰罗", "骐菱", "奇兵", "黑金刚"],
        "C-长城": ["V80", "C50", "C30", "C20R", "精灵", "风骏", "哈弗", "嘉誉", "酷熊", "凌傲", "赛弗", "赛影", "腾翼", "炫丽", "赛骏", "赛酷", "金迪尔", "赛铃"],
        "D-大迪": ["都市威菱", "都市骏马", "霸道", "皮卡"],
        "D-道奇": ["凯领", "公羊", "翼龙", "酷搏", "酷威", "锋哲"],
        "D-大运": [],
        "D-大发": ["森雅"],
        "D-东南": ["菱悦V3", "菱致V5", "菱帅", "得利卡", "富利卡", "菱利", "菱动", "凌仕V6"],
        "D-东风": ["风行", "景逸", "风神", "小康", "帅客", "汗马", "小王子", "桑蒂雅"],
        "D-大宇": ["典雅", "蓝龙", "旅行家"],
        "D-大众": ["凌渡", "CC", "EOS", "波罗", "途观", "速腾", "迈腾", "捷达", "帕萨特", "朗逸", "尚酷", "凌度", "朗行", "桑塔纳", "宝来", "高尔夫", "高尔", "途安", "途威", "途锐", "甲壳虫", "辉腾", "开迪", "夏朗"],
        "F-福特": ["蒙迪欧", "福克斯", "嘉年华", "S-MAX", "GT", "锐界", "翼虎", "翼博", "野马", "福莱克斯", "商务车"],
        "F-丰田": ["凯美瑞", "卡罗拉 ", "汉兰达", "雅力士", "锐志", "花冠", "皇冠", "逸致", "兰德酷路泽", "威驰", "FJ酷路泽", "霸道", "RAV4", "普锐斯", "大霸王", "佳美", "陆地巡洋舰", "柯斯达", "海狮", "特锐"],
        "F-福迪": ["UFO", "卡车"],
        "F-法拉利": ["F360", "575", "F430", "599GTB", "612", "California", "ENZO"],
        "F-福田": ["迷迪", "传奇", "蒙派克", "风景冲浪", "爱尔法", "奥铃", "风景海狮"],
        "F-菲亚特": ["西耶那", "周末风", "派力奥", "派朗"],
        "G-GMC": ["商务之星"],
        "G-广汽": ["传祺GA5", "传祺GS5"],
        "H-华普": ["飚风", "朗风", "海炫", "M203", "美鹿", "飓风", "海锋", "海尚", "海迅", "海域", "海悦"], "H-汇众": ["伊思坦纳"],
        "H-悍马": ["H3", "H2", "H1"],
        "H-海马": ["欢动", "福美来", "海福星", "海马3", "普力马", "丘比特", "骑士"],
        "H-哈飞": ["赛豹", "赛马", "路宝", "中意", "民意"], "H-华泰": ["特拉卡", "圣达菲", "康迪", "格林伯德"], "H-黑豹": ["轿卡", "旅行家", "货车"], "H-红旗": ["盛世", "概念SUV", "旗舰", "世纪星", "明仕", "H7"], "J-金龙": ["大型客车", "中型客车", "海狮", "城市客车"], "J-吉利": ["熊猫", "中国龙", "美人豹", "美日", "自由舰", "豪情", "优利欧", "豹风"], "J-解放": ["货车"], "J-江淮": ["和悦", "同悦", "宾悦", "瑞鹰", "瑞风", "帅铃"], "J-吉普": ["2500", "2700", "指南者", "指挥官", "牧马人", "自由人", "自由客", "大切诺基", "切诺基", "城市猎人"], "J-捷豹": ["S型", "X型", "XJL", "XK", "XF"], "J-吉利帝豪": ["EC7", "EC7-RV", "EC8", "EV8"], "J-吉利上海英伦": ["SC5", "SC7", "TX4", "金鹰", "金刚", "SX6", "SX5"], "J-金杯": ["海狮", "阁瑞斯", "锐驰", "面包车", "勤务兵", "快运", "金典"], "J-江铃": ["陆风", "宝典", "轻卡", "全顺", "宝威"], "J-吉奥": ["奥腾", "凯旋", "帅威", "帅驰", "猛将旅", "凯睿", "GX6", "GS50", "财运", "伊美"], "J-吉利全球鹰": ["GC7", "GX2", "熊猫", "自由舰", "远景", "GX7"], "K-开瑞": ["优派", "优雅", "优翼", "优劲", "优优", "优胜"], "K-凯迪拉克": ["CTS", "SLS", "SRX", "XLR", "凯雷德", "帝威", "赛威"], "K-克莱斯勒": ["300C", "铂锐 ", "大捷龙", "PT漫步者", "太阳舞"], "K-凯马": [], "L-路虎": ["发现", "神行者", "揽胜", "卫士", "极光"], "L-林肯": ["领航员", "城市"], "L-兰博基尼": ["Gallardo", "Murcielago Coupe", "Reventon"], "L-力帆": ["720", "320", "520", "620", "X60"], "L-铃木": ["奥拓", "雨燕", "天语SX4", "利亚纳", "北斗星", "浪迪", "羚羊", "吉姆尼", "凯泽西", "超级维特拉"], "L-陆风": ["风华", "风尚", "X9", "X6", "X8"], "L-莲花": ["L3", "L5", "竞速", "竞悦", "欧洲之星"], "L-劳斯莱斯": ["幻影", "古思特"], "L-雷诺": ["风景", "拉古娜", "梅甘娜", "科雷傲"], "L-雷克萨斯": ["ES", "GS", "IS", "LS", "LX", "RX", "SC"], "M-迈巴赫": ["62", "57"], "M-玛莎拉蒂": ["Coupe", "GranSport", "总裁", "GT"], "M-名爵": ["3", "5", "6", "7", "TF"], "M-马自达": ["阿特兹", "CX-5", "323", "CX-7", "CX-9", "MX-5", "RX-8", "M2", "M3", "M5", "M6", "M8", "睿翼"], "N-尼桑": ["350Z", "D22", "GT-R", "逍客", "天籁", "骐达", "颐达", "骊威", "轩逸", "骏逸", "奇骏", "御轩", "奥丁", "阳光", "蓝鸟", "帕拉丁", "风度", "风雅", "贵士", "途乐", "西玛", "ZN649", "楼兰", "nv200", "公爵王"], "N-南汽": ["新雅途"], "N-纳智捷": ["大7 SUV", "MASTER CEO"], "O-讴歌": ["MDX", "RL", "TL"], "O-欧宝": ["GT", "安德拉", "赛飞利", "威达", "雅特", "欧美佳", "欧捷利"], "Q-奇瑞": ["A1", "A3", "A5", "E5", "QQ", "瑞虎", "东方之子", "旗云", "风云"], "Q-起亚": ["K3", "K2", "K5", "狮跑", "福瑞迪", "赛拉图", "RIO锐欧", "智跑", "千里马", "普莱特", "佳乐", "欧菲莱斯", "索兰托", "嘉华", "秀尔", "远舰", "霸锐", "威客"], "Q-启辰": ["D50", "R50", "E30"], "R-荣威": ["E50", "350", "550", "750", "950", "W5"], "R-瑞麒": ["G3", "G5", "G6", "M1", "M5", "X1", "2"], "S-斯巴鲁": ["森林人", "驰鹏", "傲虎", "力狮", "翼豹"], "S-萨博": ["9-3", "9-5"], "S-时代": ["货车"], "S-斯柯达": ["昕锐", "昕动", "晶锐", "明锐", "昊锐", "速派", "欧雅", "法比亚"], "S-上汽大通": ["D90", "V80", "G10"], "S-曙光": ["傲羚", "娇子", "法萨特", "征服者", "旗胜", "领航者", "大柴神", "挑战者", "傲龙", "翱龙", "SUV"], "S-双龙": ["爱腾", "路帝", "享御", "主席", "柯兰多", "雷斯特"], "S-双环": ["来宝SRV", "小贵族", "来旺", "SCEO"], "S-三菱": ["帕杰罗", "蓝瑟", "戈蓝", "欧蓝德", "君阁", "翼神", "格蓝迪", "菱绅"], "T-唐骏": [], "T-特斯拉": ["MODEL S"], "W-沃尔沃": ["C30", "C70", "S40", "S60", "S70", "S80", "V60", "V70", "XC60", "XC70", "XC90"], "W-五十铃": ["货车", "皮卡", "铁金刚"], "W-威麟": ["V5", "H5", "X5"], "W-五菱": ["之光", "兴旺", "宏光", "荣光"], "W-万丰": ["多功能商务车", "速威", "泰威", "皮卡"], "X-夏利": ["夏利", "N3", "2000", "N5"], "X-现代": ["i30", "ix25", "ix35", "朗动", "伊兰特悦动", "名图", "伊兰特", "劳恩斯", "酷派", "途胜", "瑞纳", "索纳塔八", "索纳塔九", "索纳塔", "雅绅特", "胜达", "格锐", "雅科仕", "美佳", "世纪", "君爵", "维拉克斯", "雅尊", "SONATA御翔", "新胜达", "领翔"], "X-雪铁龙": ["DS", "C2", "C3", "C4", "C5", "C6", "世嘉", "爱丽舍", "赛纳", "凯旋", "毕加索", "富康"], "X-雪佛兰": ["迈锐宝", "科迈罗", "斯帕可", "沃蓝达", "科鲁兹", "赛欧", "爱唯欧", "乐风", "乐驰", "景程", "科帕奇", "乐骋 ", "子弹头"], "y-依维柯": ["宝迪", "都灵", "得意"], "y-一汽": ["威乐", "威姿", "威志", "森雅", "特锐", "夏利", "佳宝", "自由风"], "Y-跃进": ["货车"], "y-永源": ["UFO", "A380"], "y-英菲尼迪": ["G系", "M系", "EX", "FX", "QX"], "Z-中顺": ["MPV", "皮卡", "SUV", "世纪"], "Z-众泰": ["江南TT", "M300", "Z200", "2008", "Z300", "5008", "梦迪博朗", "V10"], "Z-重汽": [], "Z-中兴": ["无限", "海豹", "皮卡", "田野SUV", "驰野", "福星", "威虎", "金狮", "万禧龙"], "Z-中华": ["骏捷", "酷宝", "H530", "尊驰", "V5"]
      },
      letters: []
    }

  },
  computed:function() {
      this.letter();
  },
  methods: {
    choiceBrand: function () {
      this.isShowBrandModel = true;
    },
    goback: function () {
      console.log(this);
      this.$router.go(-1);
    },
    letter: function() {

      for(let i=0;i< this.brands.length;i++){
        console.log(this.brands[i].subStr(1));
        this.letters.push(this.brands[i].charAt(1));
      }
      console.log(this.letters);
    }
  }
}
</script>